{
    "title": "About me", 
    "about": "I am presently engaged in a focused pursuit of opportunities in the domains of Entry Level Software Engineer and Entry Level Machine Learning Engineer with interest in NLP, Generative AI, Computer Vision, Data Mining.\nCurrently, I am actively involved in two prestigious initiatives, namely the Amazon Alexa Prize SocialBot Grand Challenge and Alexa Prize TaskBot Challenge. These engagements have afforded me invaluable research experiences in NLP and CV and insights into cutting-edge technologies and real-world problem-solving.\nAs a dedicated and high-achieving student, I remain steadfast in my pursuit of excellence across all academic and extracurricular pursuits. My character is characterized by a strong sense of positivity, confidence, self-discipline, sociability, and a genuine willingness to assist others. I consistently challenge myself to surpass boundaries and deliver my utmost dedication and commitment to any undertaking.\nMy profound passion and devotion lie in the fields of computer science and machine learning, and I am committed to contributing my skills and knowledge to make meaningful advancements in these domains.", 
    "skills": {
        "languages": ["Python"(NumPy, Pandas, Matplotlib, Seaborn, Scikit-Learn, TensorFlow, PyTorch, Keras, Scrapy, Selenium, BeautifulSoup, Flask, Qiskit), C++, C, Java, Javascript, CSS/HTML, SQL
    ]
    }
Skills:

Languages: 
Frameworks: Flask, PostgreSQL, React Native

Developer Tools: Visual Studio Code, Docker, Jupyter Notebook, Vim, Xcode, Postman, Git, Jira

Libraries: PyTorch, TensorFlow, Pandas, NumPy, Keras, BeautifulSoup, Scrapy, Selenium, OpenMP, MPI, Qiskit, OpenCV

Services: AWS, SLURM
Mathematical fundamentals: Geometry, Linear Algebra, Vector Calculus, Probability, and Statistics
Computer Science fundamentals: Data Structure, Algorithms Analysis, Computer Vision, Natural Language Processing, Computer System Design, Computational Models
Please feel free to contact me at winsonchen108@gmail.com'

}


